digitalocean-report/loadtest.yml
config:
  target: "<ip>:8182"
  phases:
    -
      duration: 300
      arrivalRate: 20
      name: "Warm-up"
    -
      pause: 10
    -
      duration: 60
      arrivalCount: 100
      name: "Daily business"
    -
      duration: 600
      arrivalRate: 200
      name: "High load phase"
scenarios:
  - flow:
      - get:
          url: "/api/add?a=4&b=80"